app/Http/Controllers/Report/ServiceReportsController.php

	public function prescriptionHistory(Request $request, $param = 0) {

        //dd($request->toArray());

        $organization_id = $employee_types = $ChiefComplains = $chiefComplain_id = [];

        $start_date = '01-'.date('m-Y');
        $end_date_To = Carbon::now()->format('d-m-Y');
        $authUserId = auth()->user()->id;
        $end_date = $end_date_To;
        $organizations = Organization::pluck('short_name','id');
        $ChiefComplains = ChiefComplain::pluck('name','id');
---
select `short_name`, `id` from `organizations`
select `name`, `id` from `chief_complains`