app/Http/Controllers/ChiefComplainsController.php

select * from `chief_complains`
---
    public function index()
    {
        $chiefComplain = ChiefComplain::get();