app/Http/Controllers/Controller.php

select `id`, `name`, `parent_id` from `permissions` where `permissions`.`id` in (38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 72, 89, 90, 91, 92, 93, 94, 95, 96, 166, 167, 168, 169, 170, 171, 172, 173, 174, 195, 196, 202, 239, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 356, 357, 372, 380, 512, 513, 514, 515, 516, 517, 518, 519, 520, 521, 531, 532, 533, 534, 535, 536, 537, 538, 539, 540)
select * from `site_settings` limit 1
---
	public function __construct() {
		$this->middleware(function ($request, $next) {
			if ($request->user()) {
				$rolePermissions = RolePermission::select('permission_id')
					->with(['permission' => function ($q) {
						$q->select('id', 'name', 'parent_id');
					}])
					->where('role_id', $request->user()->role_id)
					->get()
					->toArray();
					//dd($rolePermissions);
				$controllerArr = [];
				$allIndexes = [];
				foreach ($rolePermissions as $key => $value) {
					if ($value['permission']['parent_id'] == null) {
						$controllerArr[$value['permission']['id']] = $value['permission']['name'];
					} else {
						$allIndexes[] = $controllerArr[$value['permission']['parent_id']] . '@' . $value['permission']['name'];
					}
				}

				$this->menu_list = $allIndexes;

				view()->share('controller_list', $controllerArr);
				view()->share('menu_list', $allIndexes);
			}

			$this->site_settings = SiteSetting::first();