app/Http/Controllers/EmployeesController.php

select * from `users` where `users`.`id` = 31 limit 1
select `name`, `id` from `locations` where `parent_id` is null
---
    public function index()
    {
        $user = \App\User::find(auth()->id());
        //dd($user->toArray());
        $Organization_id = $user['organization_id'];
        //dd($Organization_id);
        $divisions = Location::whereNull('parent_id')->pluck('name', 'id');

select `name`, `id` from `departments`
select `title`, `id` from `designations`
select `name`, `id` from `office_locations`
select `name`, `id` from `regions`
select `organization`, `id` from `organizations`
select `name`, `id` from `locations` where `parent_id` is null
---
    public function create()
    {
        //dd('Zashidul');

       // dd(str_plural('child'));
        $departments = Department::pluck('name','id');
        $designations = Designation::pluck('title','id');
        $officelocations = OfficeLocation::pluck('name','id');
        $regions = Region::pluck('name','id');
        $organizations = Organization::pluck('organization','id');
        $divisions = Location::whereNull('parent_id')->pluck('name', 'id');

select * from `employees` where `employees`.`id` = '819' limit 1
select `name`, `id` from `locations` where `parent_id` is null
select `name`, `id` from `office_locations`
select `name`, `id` from `regions`
---
    public function edit($id)
    {
        $employees[0] = Employee::findOrFail($id);
        //$employees = $employees[0];
        //dd($employees->toArray());
        //$employees = $employees->child_details[0];
        $divisions = Location::whereNull('parent_id')->pluck('name', 'id');
        //dd($divisions->toArray());
        $districts = Location::where('parent_id', $employees[0]->division_id[0])->pluck('name', 'id');
        //dd($districts);
        $thanas = Location::where('parent_id', $employees[0]->district_id[0])->pluck('name', 'id');
        //dd($thanas);
        $departments = Department::pluck('name','id');
        $designations = Designation::pluck('title','id');
        $officelocations = OfficeLocation::pluck('name','id');
        $regions = Region::pluck('name','id');

select `name`, `id` from `departments`
select `title`, `id` from `designations`
select `organization`, `id` from `organizations`
---
    public function viewEmployee($id)
    {
        $employees = Employee::with([
            'designation' => function ($q) {
                return $q->select('id', 'title');
            },
            'organization' => function ($q) {
                return $q->select('id', 'organization');
            },
            'department'=>function($q){
                return $q->select('id', 'name');
            },
            'user'=>function($q){
                return $q->select('*');
            },



        ])
        ->where('id',$id)
        ->where('status','active')
        ->get();