app/Http/Controllers/HomeController.php

select `can_apply` from `roles` where `id` = 1 limit 1
---
	public function __construct() {
		parent::__construct();
		$this->middleware(function ($request, $next) {
			if ($request->user()) {
				$this->user = $request->user();
				$this->canApply = (bool) Role::where('id', $this->user->role_id)->value('can_apply');

select count(*) as aggregate from `items` inner join `shops` on `shops`.`id` = `items`.`shop_id` inner join `distributor_users` on `distributor_users`.`distributor_id` = `shops`.`distributor_id` inner join `shops` as `distributor` on `distributor`.`id` = `shops`.`distributor_id` where `distributor_users`.`user_id` = 31 and `items`.`freeze_status` in ('used', 'low_cooling', 'damage_applied') and `item_status` is not null
select `items`.`freeze_status`, count(*) as total from `items` inner join `shops` on `shops`.`id` = `items`.`shop_id` inner join `distributor_users` on `distributor_users`.`distributor_id` = `shops`.`distributor_id` inner join `shops` as `distributor` on `distributor`.`id` = `shops`.`distributor_id` where `distributor_users`.`user_id` = 31 and `items`.`freeze_status` in ('damage', 'support', 'low_cooling') group by `items`.`freeze_status`
select count(*) as aggregate from `items` where `shop_id` is null and `freeze_status` = 'damage'
---
	private function getDFStatus() {
		$rawDataArr = [
			'purchased' => 0,
			'injected' => 0,
			'stock' => 0,
			'in_sip' => 0,
			'damage' => 0,
			'support' => 0,
			'low_cooling' => 0,
			'initial_damage' => 0,
		];

		$itemObj = Item::join('shops', 'shops.id', '=', 'items.shop_id')
			->join('distributor_users', 'distributor_users.distributor_id', '=', 'shops.distributor_id')
			->join('shops as distributor', 'distributor.id', '=', 'shops.distributor_id')
			->where('distributor_users.user_id', auth()->user()->id);

		$itemObj2 = clone $itemObj;
		$itemObj3 = clone $itemObj;

		//Injected DF
		$injected = $itemObj->whereIn('items.freeze_status', ['used', 'low_cooling', 'damage_applied'])
			->whereNotNull('item_status')
			->count();

		// For Damage, Support, Low cooling
		$items = $itemObj2->select('items.freeze_status', DB::raw('count(*) as total'))
			->whereIn('items.freeze_status', ['damage', 'support', 'low_cooling'])
			->groupBy('items.freeze_status')
			->pluck('total', 'items.freeze_status');

		//damage when receive in depot
		$initialDamage = Item::whereNull('shop_id')
			->where('freeze_status', 'damage')
			->count();

select count(*) as aggregate from `items` inner join `depot_users` on `depot_users`.`depot_id` = `items`.`depot_id` where `depot_users`.`user_id` = 31 and (`items`.`item_status` = 'locked' or `items`.`item_status` is null) and `items`.`freeze_status` in ('used', 'fresh', 'low_cooling')
---
			->count();

		// For Stock In hand and
		$stock = Item::join('depot_users', 'depot_users.depot_id', '=', 'items.depot_id')
			->where('depot_users.user_id', $this->user->id)
			->where(function ($query) {
				$query->where('items.item_status', 'locked')
					->orWhereNull('items.item_status');
			})
			->whereIn('items.freeze_status', ['used', 'fresh', 'low_cooling'])
			->count();

select count(*) as aggregate from `depot_users` where `user_id` = 31
---
	private function depotWiseDfStatus() {

		if (DepotUser::where('user_id', $this->user->id)->count() > 2) {

select `shops`.`id` from `shops` inner join `distributor_users` on `distributor_users`.`distributor_id` = `shops`.`distributor_id` inner join `settlements` on `shops`.`id` = `settlements`.`shop_id` where `settlements`.`status` in ('continue', 'reserve') and `shops`.`is_distributor` = 0 and `distributor_users`.`user_id` = 31 group by `shops`.`id`
select count(*) as aggregate from `shops` inner join `distributor_users` on `distributor_users`.`distributor_id` = `shops`.`id` where `is_distributor` = 1 and `distributor_users`.`user_id` = 31
---
	private function getOutletStatus() {
		$retailers = Shop::join('distributor_users', 'distributor_users.distributor_id', '=', 'shops.distributor_id')
			->join('settlements', 'shops.id', '=', 'settlements.shop_id')
			->whereIn('settlements.status', ['continue', 'reserve'])
			->where('shops.is_distributor', false)
			->where('distributor_users.user_id', $this->user->id)
			->groupBy('shops.id')
			->select('shops.id')
			->get()
			->count();

		$distributors = Shop::join('distributor_users', 'distributor_users.distributor_id', '=', 'shops.id')
			->where('is_distributor', true)
			->where('distributor_users.user_id', $this->user->id)
			->count();

select `zones`.`code`, count(items.id) as total from `items` inner join `shops` on `shops`.`id` = `items`.`shop_id` inner join `distributor_users` on `distributor_users`.`distributor_id` = `shops`.`distributor_id` inner join `zones` on `zones`.`id` = `shops`.`region_id` where `distributor_users`.`user_id` = 31 and `items`.`freeze_status` in ('used', 'low_cooling', 'damage_applied') and `items`.`shop_id` is not null and `items`.`item_status` is not null group by `zones`.`id`, `zones`.`code`
---
	private function getMapData() {
		$regionCode = [
			'01' => 'Dhaka',
			'02' => 'Dhaka',
			'03' => 'Dhaka',
			'04' => 'Dhaka',
			'05' => 'Dhaka',
			'06' => 'Chittagong',
			'07' => 'Comilla',
			'08' => 'Sylhet',
			'09' => 'Khulna',
			'10' => 'Bogra',
		];

		$reverseArr = array_fill_keys(array_unique($regionCode), 0);

		$data = Item::join('shops', 'shops.id', '=', 'items.shop_id')
			->join('distributor_users', 'distributor_users.distributor_id', '=', 'shops.distributor_id')
			->join('zones', 'zones.id', '=', 'shops.region_id')
			->where('distributor_users.user_id', auth()->id())
			->whereIn('items.freeze_status', ['used', 'low_cooling', 'damage_applied'])
			->whereNotNull('items.shop_id')
			->whereNotNull('items.item_status')
			->select('zones.code')
			->selectRaw('count(items.id) as total')
			->groupBy('zones.id', 'zones.code')
			->get();

select `name`, `id` from `depots`
---
	public function index() {

		$canApply = $this->canApply;
		$requisitions = $complainStatus = $df_returns = $damage_applications = $regionalDfStatus = false;

		$shops = $this->getOutletStatus();
		$items = $this->getDFStatus();
		//for payement verify
		$payments = $this->getPayment();
		$payment = $payments['payment'];
		$bkash = $payments['bkash'];

		$mapDatas = $this->getMapData();

		if (isMenuRender('RequisitionsController@index', $this->menu_list)) {
			$requisitions = $this->getRequistionCount();
		}

		if (isMenuRender('DfReturnsController@index', $this->menu_list)) {
			$df_returns = $this->getReturnDfStatus();
		}

		$depots = Depot::pluck('name', 'id');

select `name`, `id` from `locations` where `parent_id` is null
select `name`, `id` from `locations` where `parent_id` = 5
select `name`, `id` from `locations` where `parent_id` = 33
---
		if ($districtId && is_array($districtId)) {
			$districtId = $districtId[0];
		}
        $divisions = Location::whereNull('parent_id')->pluck('name', 'id');
        //dd($divisions);
        $districts = Location::where('parent_id', $divisionId)->pluck('name', 'id');
        //dd($districts);
        $thanas = Location::where('parent_id', $districtId)->pluck('name', 'id');