app/Http/Controllers/RolesController.php

select * from `roles` order by `is_deletable` desc
select `name`, `id` from `roles`
---
    public function index() {
        $roles = Role::orderBy('is_deletable', 'desc')->get();
        $roleArr = Role::pluck('name', 'id');

select * from `roles` where `roles`.`id` = '1' limit 1
select * from `permissions` where `permissions`.`parent_id` in (38, 46, 49, 56, 65, 89, 97, 104, 166, 176, 218, 268, 276, 284, 292, 512, 523, 531, 539, 541, 544, 547, 549, 551, 553, 555, 557)
select `permission_id` from `role_permissions` where `role_id` = '1'
---
    public function edit($id) {
        $roles = Role::findorfail($id);
        $permissions = Permission::with('children')->whereNull('parent_id')->orderBy('name')->get()->toArray();
        $checkPermissions = RolePermission::with('Permission')->where('role_id', $id)->pluck('permission_id')->toArray();

insert into `permissions` (`name`) values ('OpenHandlerController')
select * from `permissions` where (`name` = 'OpenHandlerController') limit 1
insert into `permissions` (`parent_id`, `name`) values (541, 'handle')
select * from `permissions` where (`parent_id` = 541 and `name` = 'handle') limit 1
---

        // Create permissions
        foreach ($controllers as $controllerName => $methods) {
            $parent = Permission::firstOrCreate(['name' => $controllerName]);

            foreach ($methods as $methodName) {
                Permission::firstOrCreate([
                    'parent_id' => $parent->id,
                    'name' => $methodName
                ]);